app/controllers/blocked_words_controller.rb

SELECT "blocked_words"."word" FROM "blocked_words"
---
	def index
		@blocked_list = BlockedWord.pluck(:word)

INSERT INTO "blocked_words" ("word", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["word", "caralho"], ["created_at", "2016-01-18 03:18:25.958129"], ["updated_at", "2016-01-18 03:18:25.958129"]]
---
	def create
		@blocked_word = BlockedWord.create(word: params[:word])