app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."comment_id" IS NULL LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."comment_id" IS NULL
---
	def index
		@comments = Comment.all.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "comments" ("message", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "oooooooooooooooooo"], ["comment_id", 1], ["created_at", "2016-01-17 12:34:41.639000"], ["updated_at", "2016-01-17 12:34:41.639000"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
	def create
		 @comment = Comment.new(message: params[:message], comment_id: params[:comment_id])

  		 @comment.save
  		 redirect_to Comment.find(@comment.get_first_parent.id)

SELECT "comments".* FROM "comments" WHERE "comments"."comment_id" = $1  [["comment_id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."comment_id" = $1 LIMIT 5 OFFSET 0  [["comment_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."comment_id" = $1  [["comment_id", 1]]
---
	def show
		@comment = Comment.find(params[:id])
		@comment_children_list = @comment.children.paginate(:page => params[:page], :per_page => 5)