app/controllers/comments_controller.rb

	def create
		 message = CommentHelper.validate_message(params[:message], BlockedWord.pluck(:word))
---
SELECT "blocked_words"."word" FROM "blocked_words"